import 'package:untitled4/models/governorate_m.dart';
import 'package:url_launcher/url_launcher.dart';

class GovernoratesData {
  static const List<Governorate> governorates = [
    Governorate(
      name: "دمشق",
      description: "العاصمة السورية وتعد من أقدم مدن العالم.",
      image: "assets/images/جامع (4).jpg",
      places: [
        TouristPlace(
          name: "الجامع الأموي",
          description:
              "يُعدّ الجامع الأمويّ من أهمّ المنشآت المعماريّة في الحضارة الإسلاميّة.",
          information: '''
يُعدّ الجامع الأمويّ من أهمّ المنشآت المعماريّة في الحضارة الإسلاميّة، يقع في قلب مدينة دمشق القديمة.
بُدئ في بنائه عام 705م على يد الوليد بن عبد الملك وعلى أرضٍ خُصّصت للعبادة منذ مئات السّنين.
استغرقت عملية البناء عشر سنوات، فجاء تحفة فنيّة غاية في الدّقة والجمال وعُدّ َمن أعاجيب الدّنيا.
وقال عنه سوفاجيه أوّل نجاحٍ معماريٍ في الإسلام.
يأخذ الجامع شكل مستطيل طوله 156م وعرضه 97م.
له صحن واسع تقوم من حول جهاته الثّلاث أروقة محمولة على أقواس مستديرة، في حين شُيّد على طرفه الرّابع جدار الحرم الذي يبلغ طوله 139م وعرضه 37م.
قبّة الخزنة أو قبّة المال
بُنيت قبّة الخزنة لوضع أموال المسلمين فيها. لها شكل مثمّن قائمة على ثمانية أعمدة كورنثيّة  الطّراز جميلة التّيجان زُيّنت بالفسيفساء الملوّنة.
الحرم
 يبلغ طول الحرم 139م وعرضه 37م، ويقسمه إلى نصفين متساويين رواق قاطع ممتدّ من الشّمال إلى الجنوب.
في وسط الحرم قبّة النّسر التي ترتفع 36م محمولة على أربعة أعمدة كبيرة فوقها رقبة مثمّنة مزوّدة بالنّوافذ.
داخل الحرم أربعة محاريب ثلاثة منها قديمة وواحد حديث في الطّرف الشّرقي.
المحراب المالكي يليه المحراب الحنفي المزّين بالرّخام والصّدف والمرمر ليكون تحفة في الإبداع والجمال.
في أقصى الطّرف الغربيّ للحرم المحراب الحنبلي يليه المحراب الشّافعي.
ويقوم ضريح  مهيب من الرّخام في الطّرف الشّرقي من الحرم للنّبي يحيى عليه السّلام.
للجامع ثلاث مآذن هي: 
مئذنة العروس وتقوم وسط الرّواق الشّمالي، بُنيت بين سنتي 570 و580 هجريّة، ويعود قسمها السّفلي إلى عهد الوليد بن عبد الملك.
مئذنة عيسى تقوم في الزّاوية الجنوبيّة الشّرقيّة، وقد بُنيت فوق برج المعبد القديم،
احترقت وتهدّمت مرّاتٍ عدّة، يرجع بناء قسمها السّفلي إلى العهد المملوكيّ وقسمها العلويّ إلى العهد العثمانيّ.
المئذنة الغربيّة تقع في الزّاوية الجنوبيّة الغربيّة، أُقيمت فوق برجٍ قديم وتشير الكتابة المنقوشة عليها أنّها تجدّدت بعد الحريق الذي أصابها عام 884 هجرية في عهد السّلطان قايتباي وتُعدّ الأجمل. 
تُعتبر الفسيفساء الزّجاجيّة الملوّنة والمذهّبة التي زينت جدران وأروقة وأقواس الجامع الأمويّ من أجمل وأهمّ الثّروات الفنيّة الإسلاميّة في سورية. 
تعرّض الجامع لكوارث وحرائق فتأثّر رخامه وفسيفساؤه وانهارت أجزاء منه.
''',
          images: [
            "assets/images/جامع (4).jpg",
            "assets/images/جامع.jpg",
            "assets/images/DJI_0042.MOV_snapshot_00.21.760.jpg"
          ],
          signLanguageVideoUrl:
              "https://youtu.be/JIJ_V4MGcKo?si=ZJ4KuIX9Tt8BHmJC",
          VideoUrl:
              "https://youtube.com/shorts/N3Rj-w8Zztk?si=2R216nRgpluHvTi-",
          latitude: 33.5117,
          longitude: 36.3064,
          tourismType: "religious",
        ),
      ],
    ),
    Governorate(
      name: "حمص",
      description:
          "من أجمل قلاع العالم الأثريّة ومن أفضل التّحصينات الفرنجيّة في الشّرق وأكثرها حفظاً",
      image: "assets/images/حصن.jpg",
      places: [
        TouristPlace(
          name: "قلعة الحصن",
          description:
              "من أجمل قلاع العالم الأثريّة ومن أفضل التّحصينات الفرنجيّة في الشّرق وأكثرها حفظاً",
          information:
              '''"من أجمل قلاع العالم الأثريّة ومن أفضل التّحصينات الفرنجيّة في الشّرق وأكثرها حفظاً، فهي قلعة عسكريّة صليبيّة تقع ضمن سلاسل جبال السّاحل السّوري غربي مدينة حمص وتُقدّر مساحتها بثلاثة هكتارات.
القلعة حصنان داخلي وخارجي، بينهما خندق وحولهما خندق يشرف عليها جميعاً قصرٌ تحميه أبراج.
الحصن الخارجيّ
يتألف الحصن الخارجيّ من السّور الخارجيّ ومجموعة القاعات والإسطبلات والمستودعات وغرف الحرس، ومزّود بثلاثة عشر برجاً بعضها دائريّ وبعضها مربّع ومستطيل، وهو أيضاً محاط بخندق ومدعوم بالجدران المائلة. 
برج الظّاهر بيبرس
أحد الأبراج الدفاعيّة من الجهة الجنوبيّة الغربيّة ضمن السّور الخارجيّ، له شكل دائريّ فيه عدّة مرامٍ للنّبال والسّهام منها مبنيّة ومصمّمة بالفترة الصّلبيّة وأخرى بالفترة المملوكيّة. يتوسّطه عمود مثمّن.
برج السّلطان قلاون 
أكبر الأبراج الدّفاعيّة في القلعة على سطح السّور الخارجيّ من الجهة الجنوبيّة، له بناء وتصميم عربي. نصل سطحه عبر درج نصف دائريّ حيث يمكن أن نكشف المحيط الكامل للمنطقة.
برج الرّبط بين السّورين الدّاخليّ والخارجيّ 
برج دفاعي يربط بين السّورين الدّاخليّ والخارجيّ، له مدخلان الأوّل يؤدي إلى داخل القلعة والثّاني يؤدي إلى القسم الخارجيّ، من أقسامه السّور الحجري العالي المتضمّن عدّة أبراج بالإضافة إلى الخندق المائيّ.
الحصن الداخليّ
يتألّف الحصن الدّاخليّ من قلعة قائمة بذاتها شُيّدت فوق قاعدة صخريّة مرتفعة، يعزلها عن السّور الخارجيّ خندق عريض في الصّخر وكُسيت جدرانه بالحجارة المنحوتة، ويُملأ قسم من الخندق بالماء فيدعى البركة، ويشرف الحصن الدّاخليّ على السّور الأوّل ومنشآته إشرافاً تاماً.

السّور الدّاخليّ
يرتفع السّور الثّاني خلف البركة الكبرى مباشرةً وابتداءً من الطّرف الشّرقيّ للواجهة الجنوبيّة، وهو جدار استنادي ضخم منحدر الجهة، ارتفاعة 26م.
أبراج السّور الدّاخليّ
الأبرج الدّاخليّة للقلعة أبراج للإقامة والسّكن عددها خمسة، هي: برج القائد وهو أعلى سلطة في القلعة، وبرج القادة وأبراج مراقبة وبرج بيت الملك وهو برج دفاعي من الدّاخل وكذلك للإقامة.
قاعة الفرسان
القاعة مبنيّة على عدّة مراحل، بذلك نرى فيها بناء بفنّ رومانيّ وبناء بفنّ غوطيّ (صليبيّ) وبناء بفنّ عربيّ. وهي قاعة حربيّة عسكريّة، وتتكوّن من القاعة الرّئيسيّة والتّراس الصّيفي.
الكنيسة
بُنيت في العهد الصّليبيّ حُوّلت لمسجد في عهد المماليك، وهي ذات سقف عالٍ جداً.
تمتاز القلعة بلون حجارتها الكلسيّة التي كانت تجلب من مسافة / 4 كم / من بلدة مجاورة تُدعى /عمار الحصن/ وميزة الحجر الكلسي أنّه طيّع أثناء النّحت وخفيف الوزن.


''',
          images: [
            "assets/images/حصن.jpg",
            "assets/images/حصن 1.jpg",
          ],
          signLanguageVideoUrl:
              "https://youtu.be/7EEiva0RNw4?si=9XR9FAYD8O6H2rtY",
          VideoUrl:
              "https://youtube.com/shorts/_S7gRZlyKJ8?si=aUlg1PDYlLgBCYJU",
          latitude: 34.7300,
          longitude: 36.7200,
          tourismType: "religious",
        ),
      ],
    ),
    Governorate(
      name: "طرطوس",
      description: "مدينة سورية تقع على ضفاف نهر الأوردة.",
      image: "assets/images/المرقب طرطوس.j2.jpg",
      places: [
        TouristPlace(
          name: "قلعة المرقب",
          description:
              "بُنيت قلعة المرقب فوق مرتفعٍ جبليّ صخوره من البازلت مشرف على البحر مقابل مدينة بانياس",
          information:
              '''"بُنيت قلعة المرقب فوق مرتفعٍ جبليّ صخوره من البازلت مشرف على البحر مقابل مدينة بانياس، وتتميّز القلعة عن سائر القلاع بموقعها المنيع وتحكّمها بالطّريق السّاحلي (اللّاذقية - طرطوس) ترتفع عن مستوى سطح البحر /370/م.
معظم القلعة مبنيّ من الحجارة البازلتيّة يحيط بها سوران وخندق ومجموعة من الأبراج الضّخمة ومنشآت عسكريّة ومدنيّة، بعضها صليبيّة وبعضها الأخر عربيّة ومجموعة من الآبار.
وتوجد كنيسة جيّدة المعالم وهي أعلى الأبنية المطلّة على السّاحة تأخذ اتجاه شرق غرب وبشكل طولاني كما كلّ الكنائس، تتميّز بدقّة بنائها، اكتُشفت فيها لوحة جداريّة ملوّنة دينيّة تمثّل السّيد المسيح وتلاميذه، يلحق بها برج الصّبي ومرفأ صغير على شاطئ البحر.
شُيّد أوّل حصن فيها عام 1062م من قبل أحد زعماء المنطقة.
احتلّها حاكم أنطاكية الصّليبيّ عام 1118 م إلى أن حرّرها السّلطان قلاوون 1285م بعد حصار طويل.
''',
          images: [
            "assets/images/المرقب طرطوس.j2.jpg",
            "assets/images/مراقب   1.jpg",
            "assets/images/مراقب   0.jpg",
            "assets/images/المرقب طرطوس.jpg"
          ],
          signLanguageVideoUrl:
              "https://youtu.be/x7cu099yH70?si=cCJ66psPTwaIDKvo",
          VideoUrl:
              "https://youtube.com/shorts/7jP0VjWwm_U?si=Mxi-jcaloPhbOrbe",
          latitude: 36.2000,
          longitude: 37.1500,
          tourismType: "religious",
        ),
      ],
    ),
  ];
}

void _launchUrl(String url) async {
  final uri = Uri.parse(url);
  if (await canLaunchUrl(uri)) {
    await launchUrl(uri, mode: LaunchMode.externalApplication);
  }
}
